app/controllers/readings_controller.rb

  def index
    @readings = Reading.all
---
SELECT "readings".* FROM "readings"